#num 1 
print("С начала суток прошло: (введите сек.)")
a = int(input())
print("С начала последней минуты прошло", a % 60, "секунд.")


#num 2 
print("Введите день: (1-365)")
a = int(input())
b = a % 7
a = ["воскресенье", "понедельник", "вторник", "среда", "четверг", "пятница", "суббота"]
print("В этот день был(а) -", a[b])


#num 3
print("Введите день: (1-365)")
a = int(input())
print("Введите номер первого дня:")
n = int(input())
b = a % 7 
a = ["воскресенье", "понедельник", "вторник", "среда", "четверг", "пятница", "суббота", "воскресенье", "понедельник", "вторник", "среда", "четверг", "пятница", "суббота", "воскресенье"]
print("В этот день был(а) -", a[b + n - 1])


#num 4 
print("Введите 3 положительных числа a, b, c:")
a = int(input())
b = int(input())
c = int(input())
print("На прямоугольнике a x b поместилось", (a // c) * (b // c), "квадрат(ов) со стороной с")
print("Площадь незанятой части прямоугольника:", (a * b) - ((a // c) * (b // c) * c**2))


#num 5 
print("Введите год для подсчета его столетия:")
a = int(input())
if a % 100 != 0:
    print("Столетие", a, "года:", (a // 100 + 1), "-е")
else: 
    print("Столетие", a, "года:", (a // 100), "-е")

